PinguinoIDE/pinguino-compilers/windows64/p8/share/gputils/header/p18f24k22.inc
;----- CONFIG1H Options --------------------------------------------------
_FOSC_LP_1H          EQU  H'F0'    ; LP oscillator
_FOSC_XT_1H          EQU  H'F1'    ; XT oscillator
_FOSC_HSHP_1H        EQU  H'F2'    ; HS oscillator (high power > 16 MHz)
_FOSC_HSMP_1H        EQU  H'F3'    ; HS oscillator (medium power 4-16 MHz)
_FOSC_ECHP_1H        EQU  H'F4'    ; EC oscillator, CLKOUT function on OSC2 (high power, >16 MHz)
_FOSC_ECHPIO6_1H     EQU  H'F5'    ; EC oscillator (high power, >16 MHz)
_FOSC_RC_1H          EQU  H'F6'    ; External RC oscillator, CLKOUT function on OSC2
_FOSC_RCIO6_1H       EQU  H'F7'    ; External RC oscillator
_FOSC_INTIO67_1H     EQU  H'F8'    ; Internal oscillator block
_FOSC_INTIO7_1H      EQU  H'F9'    ; Internal oscillator block, CLKOUT function on OSC2
_FOSC_ECMP_1H        EQU  H'FA'    ; EC oscillator, CLKOUT function on OSC2 (medium power, 500 kHz-16 MHz)
_FOSC_ECMPIO6_1H     EQU  H'FB'    ; EC oscillator (medium power, 500 kHz-16 MHz)
_FOSC_ECLP_1H        EQU  H'FC'    ; EC oscillator, CLKOUT function on OSC2 (low power, <500 kHz)
_FOSC_ECLPIO6_1H     EQU  H'FD'    ; EC oscillator (low power, <500 kHz)

_PLLCFG_OFF_1H       EQU  H'EF'    ; Oscillator used directly
_PLLCFG_ON_1H        EQU  H'FF'    ; Oscillator multiplied by 4

_PRICLKEN_OFF_1H     EQU  H'DF'    ; Primary clock can be disabled by software
_PRICLKEN_ON_1H      EQU  H'FF'    ; Primary clock enabled

_FCMEN_OFF_1H        EQU  H'BF'    ; Fail-Safe Clock Monitor disabled
_FCMEN_ON_1H         EQU  H'FF'    ; Fail-Safe Clock Monitor enabled

_IESO_OFF_1H         EQU  H'7F'    ; Oscillator Switchover mode disabled
_IESO_ON_1H          EQU  H'FF'    ; Oscillator Switchover mode enabled

;----- CONFIG2L Options --------------------------------------------------
_PWRTEN_ON_2L        EQU  H'FE'    ; Power up timer enabled
_PWRTEN_OFF_2L       EQU  H'FF'    ; Power up timer disabled

_BOREN_OFF_2L        EQU  H'F9'    ; Brown-out Reset disabled in hardware and software
_BOREN_ON_2L         EQU  H'FB'    ; Brown-out Reset enabled and controlled by software (SBOREN is enabled)
_BOREN_NOSLP_2L      EQU  H'FD'    ; Brown-out Reset enabled in hardware only and disabled in Sleep mode (SBOREN is disabled)
_BOREN_SBORDIS_2L    EQU  H'FF'    ; Brown-out Reset enabled in hardware only (SBOREN is disabled)

_BORV_285_2L         EQU  H'E7'    ; VBOR set to 2.85 V nominal
_BORV_250_2L         EQU  H'EF'    ; VBOR set to 2.50 V nominal
_BORV_220_2L         EQU  H'F7'    ; VBOR set to 2.20 V nominal
_BORV_190_2L         EQU  H'FF'    ; VBOR set to 1.90 V nominal

;----- CONFIG2H Options --------------------------------------------------
_WDTEN_OFF_2H        EQU  H'FC'    ; Watch dog timer is always disabled. SWDTEN has no effect.
_WDTEN_NOSLP_2H      EQU  H'FD'    ; WDT is disabled in sleep, otherwise enabled. SWDTEN bit has no effect
_WDTEN_SWON_2H       EQU  H'FE'    ; WDT is controlled by SWDTEN bit of the WDTCON register
_WDTEN_ON_2H         EQU  H'FF'    ; WDT is always enabled. SWDTEN bit has no effect

_WDTPS_1_2H          EQU  H'C3'    ; 1:1
_WDTPS_2_2H          EQU  H'C7'    ; 1:2
_WDTPS_4_2H          EQU  H'CB'    ; 1:4
_WDTPS_8_2H          EQU  H'CF'    ; 1:8
_WDTPS_16_2H         EQU  H'D3'    ; 1:16
_WDTPS_32_2H         EQU  H'D7'    ; 1:32
_WDTPS_64_2H         EQU  H'DB'    ; 1:64
_WDTPS_128_2H        EQU  H'DF'    ; 1:128
_WDTPS_256_2H        EQU  H'E3'    ; 1:256
_WDTPS_512_2H        EQU  H'E7'    ; 1:512
_WDTPS_1024_2H       EQU  H'EB'    ; 1:1024
_WDTPS_2048_2H       EQU  H'EF'    ; 1:2048
_WDTPS_4096_2H       EQU  H'F3'    ; 1:4096
_WDTPS_8192_2H       EQU  H'F7'    ; 1:8192
_WDTPS_16384_2H      EQU  H'FB'    ; 1:16384
_WDTPS_32768_2H      EQU  H'FF'    ; 1:32768

;----- CONFIG3H Options --------------------------------------------------
_CCP2MX_PORTB3_3H    EQU  H'FE'    ; CCP2 input/output is multiplexed with RB3
_CCP2MX_PORTC1_3H    EQU  H'FF'    ; CCP2 input/output is multiplexed with RC1

_PBADEN_OFF_3H       EQU  H'FD'    ; PORTB<5:0> pins are configured as digital I/O on Reset
_PBADEN_ON_3H        EQU  H'FF'    ; PORTB<5:0> pins are configured as analog input channels on Reset

_CCP3MX_PORTC6_3H    EQU  H'FB'    ; P3A/CCP3 input/output is mulitplexed with RC6
_CCP3MX_PORTB5_3H    EQU  H'FF'    ; P3A/CCP3 input/output is multiplexed with RB5

_HFOFST_OFF_3H       EQU  H'F7'    ; HFINTOSC output and ready status are delayed by the oscillator stable status
_HFOFST_ON_3H        EQU  H'FF'    ; HFINTOSC output and ready status are not delayed by the oscillator stable status

_T3CMX_PORTB5_3H     EQU  H'EF'    ; T3CKI is on RB5
_T3CMX_PORTC0_3H     EQU  H'FF'    ; T3CKI is on RC0

_P2BMX_PORTC0_3H     EQU  H'DF'    ; P2B is on RC0
_P2BMX_PORTB5_3H     EQU  H'FF'    ; P2B is on RB5

_MCLRE_INTMCLR_3H    EQU  H'7F'    ; RE3 input pin enabled; MCLR disabled
_MCLRE_EXTMCLR_3H    EQU  H'FF'    ; MCLR pin enabled, RE3 input pin disabled

;----- CONFIG4L Options --------------------------------------------------
_STVREN_OFF_4L       EQU  H'FE'    ; Stack full/underflow will not cause Reset
_STVREN_ON_4L        EQU  H'FF'    ; Stack full/underflow will cause Reset

_LVP_OFF_4L          EQU  H'FB'    ; Single-Supply ICSP disabled
_LVP_ON_4L           EQU  H'FF'    ; Single-Supply ICSP enabled if MCLRE is also 1

_XINST_OFF_4L        EQU  H'BF'    ; Instruction set extension and Indexed Addressing mode disabled (Legacy mode)
_XINST_ON_4L         EQU  H'FF'    ; Instruction set extension and Indexed Addressing mode enabled

_DEBUG_ON_4L         EQU  H'7F'    ; Enabled
_DEBUG_OFF_4L        EQU  H'FF'    ; Disabled

;----- CONFIG5L Options --------------------------------------------------
_CP0_ON_5L           EQU  H'FE'    ; Block 0 (000800-001FFFh) code-protected
_CP0_OFF_5L          EQU  H'FF'    ; Block 0 (000800-001FFFh) not code-protected

_CP1_ON_5L           EQU  H'FD'    ; Block 1 (002000-003FFFh) code-protected
_CP1_OFF_5L          EQU  H'FF'    ; Block 1 (002000-003FFFh) not code-protected

;----- CONFIG5H Options --------------------------------------------------
_CPB_ON_5H           EQU  H'BF'    ; Boot block (000000-0007FFh) code-protected
_CPB_OFF_5H          EQU  H'FF'    ; Boot block (000000-0007FFh) not code-protected

_CPD_ON_5H           EQU  H'7F'    ; Data EEPROM code-protected
_CPD_OFF_5H          EQU  H'FF'    ; Data EEPROM not code-protected

;----- CONFIG6L Options --------------------------------------------------
_WRT0_ON_6L          EQU  H'FE'    ; Block 0 (000800-001FFFh) write-protected
_WRT0_OFF_6L         EQU  H'FF'    ; Block 0 (000800-001FFFh) not write-protected

